ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "global_in"
    input: "Reshape_0_param0"
    output: "Reshape_0_out0"
    name: "Reshape_0"
    op_type: "Reshape"
  }
  node {
    input: "Reshape_0_out0"
    input: "MultiThreshold_0_param0"
    output: "MultiThreshold_0_out0"
    name: "MultiThreshold_0"
    op_type: "MultiThreshold"
    attribute {
      name: "out_bias"
      f: 0.0
      type: FLOAT
    }
    attribute {
      name: "out_dtype"
      s: "BINARY"
      type: STRING
    }
    attribute {
      name: "out_scale"
      f: 1.0
      type: FLOAT
    }
    domain: "finn"
  }
  node {
    input: "MultiThreshold_0_out0"
    output: "q20Tvf"
    op_type: "StreamingDataflowPartition"
    attribute {
      name: "model"
      s: "/home/justin/jhai/paulchowresearch2020/FINN/finn_container_files/stitched_project/child_0.onnx"
      type: STRING
    }
  }
  node {
    input: "q20Tvf"
    input: "bL42S9"
    output: "u5aLGE"
    op_type: "Mul"
  }
  node {
    input: "u5aLGE"
    input: "jic69w"
    output: "MatMul_3_out0"
    op_type: "Add"
  }
  node {
    input: "MatMul_3_out0"
    input: "Mul_0_param0"
    output: "Mul_0_out0"
    name: "Mul_0"
    op_type: "Mul"
  }
  node {
    input: "Mul_0_out0"
    input: "Add_0_param0"
    output: "global_out"
    name: "Add_0"
    op_type: "Add"
  }
  name: "torch-jit-export"
  initializer {
    dims: 64
    data_type: 1
    name: "9ngMfZ"
    raw_data: "\334\010I\274\323l|\261p\253\321>\353Xm=\000\253\000\261\033\244\025>%\331\351\275\202\327\240\275\262\037\316\276\007j\013\275W\336\257\276\277\0028\276/_\353=\217D\241=qK\260\276g.?=\275\253\231>\325\023\364\260\3321\340\276\201\2556> \204\312<&:\262=\205^\271\276z\213R\277z\177`\275e/t>Z\266\244>\217\311\256\262\373_\256\274\247\214\237\275\256\226\006\272\257\347\254\276\247\226x>\220\032\252=\246\240\217\275$.\007<lk\026\276\375 \311>_\006\212\274s\347\244>\356\204\341\274d\232\220=\005\207\232=!\222\260\276\002\236\344\274\207\324\'\275\004\306J?b0\225\257\362\302%\263\313\307\334\273Z\255*4\345w\301<\376|\306>\004\233\212\274$\210\024\275\233c\225\276\304\002\244\276\217\013-\274O\305?\273\375\213\330=\243U%\2751\016\270\274\235\325\277>,\003\344>"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "BwANKe"
    raw_data: "5l\361?\234\317\270@_\200\026@\034\321-@\234YZ@\314a0?\301\230\361\276\345&\312\300\336\2609>\327\n\255>J?\341\277i&>@\261\234\232>w\241C?J\214\230@\363\250I@\271=\210?&\367\020@\036+@\300@\202$?A\3360\300{\2702?\246\"\'\276\310\220\201\277\232\300U@\223JC\277\004\006\276\277\n*\271\300\335\201=\300Cw\243\300\332c\035>,M\364\277\177IR>\340\343B\300\320\216\270\300\3778\243?k\203\215\300\346\226H\276D\264\\@\247\026\301?6\201\302?\226\211\362>\326S\212\276B\314\240\300\261h?\300\263\260v\277_\036\246?\222\022\312@\277\371\346\277\226\220^@}\314\335?s\211b@gPQ@\010\3326\300VxL@\2036/\300\344v\374\277\250\312C@\313C\215?\252\315\r@\303f\367?\255+\317>\371\005\t\300\267Y\252?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "2yUtdJ"
    raw_data: "}(NC7\334\260C/-kC\347biC\353\301\240C\257\033\246CE\005\030C\336\036pC\374\227\204C\347\227kC\273!AC\360\335iC\323\361\201Cr19C}\nHCx\302OC\230\363bC\200\247 C\030\002iCt\3140C\355B\024C\257\3644CZ+JC\236\337nC\324SMCP\243,Cn\257tC\331\037\250C-\371\360B\274+}C\370\002\017C`\324OC\350E:C+n^C\010\360\\Cd2\035C\270a?Cg\314\201C\332i/C1\313aCgy\004C9\205hC\020\272gCR\272>C\016u\rCo\202>Co)\222C\016T\246C,\336\215C\005\021HCp\266*C\212\361\035Ca\ngCv\313\206C\024N\026C-\256oC\205\004ZC\00165C\304J<C`~AC\233\317)CD\030kC\'\'\211C\220\200iC"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "Ec9Rll"
    raw_data: "i\017\237\277\347\033\2751b\310\271?\220\341\225?E\323\204\261\324x\330?L\253\225?}\374\322?\357h\302?\334\204\252?\266\226\244?c\303\261?\0275\277?=\331\220?\037\226\242?\211\270\246?\206t\274?\213\216\3402\324\373\322?\315\332\212?\307M\203\277\273=\225?\244{\271?\372\207\267?p\202\215\277\210\263\244?Cb\316?\245\336\3162\332vO??\340\334?\254U\216\277\021\213\264?65\226?B\347\220\277\304\000\215?^\257\177\277\261\363\244?\373\010\337?n&\242?\250p\302?\324g\024?\214\362\251?]\314\306?OC\263?\0339\225?V\220\216?X\r\310?\2220\266/\371\337\3022\353<\220?X\367~4-\366\215?Q \304?h\324\335\277\201\234\254?=\375\301?\223\257\254?<\341\220?\323d\270?.\227\271?\326\307\213?~\031\256?AV\270?n,\317?"
  }
  initializer {
    dims: 10
    data_type: 1
    name: "dEzGVh"
    raw_data: "\265s\256\277\250\024\242\277P\340\222\277\303=\214\277\203\267\224\277`\024\213\277VN\252\277\365\216\225\277>\365\203\277\300\215\212\277"
  }
  initializer {
    dims: 10
    data_type: 1
    name: "dlziOI"
    raw_data: "\353]\252\277@\235\322?}\350\326?\027\177S@\310\024=\276$\244$@\213r\034?\217(??\005m\004@ed\031@"
  }
  initializer {
    dims: 10
    data_type: 1
    name: "zW4Po5"
    raw_data: "bS\315C\tt\355C\337\236\227C\354\226\274CM\337\225C\236\240~C\332\021\241C}\220\272Cx\350\221C\255\013\227C"
  }
  initializer {
    dims: 10
    data_type: 1
    name: "qfWMEr"
    raw_data: "\307gl?\032_l?\372\200??\240\2643?A\3279?\336\355 ?\005\212c?L\225I?j[ ?\r\237*?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "JYuZKg"
    raw_data: "\370\221w\277\217\275}?y\322\266?C7\266\276\037\2119\2774j\025\276\243\2267?\310\356T\276B\272-?\026zF?\267\007x\277\005\256\000=Kne?-M4\277\325C\311=\375\364\253>y\362\217\277\230\311x?\300\236\t\275\236\352O?\214e\210\277\356q\367>\363s\243\276\202\270\311\2766\006F\277\352Sa?1\250\226?\344\204\300>;\264q\277\257\004 >j\207\244?\010J\301?\256l\033\276\004\022\363?\213\021\205\277\224Z\033\277e\214\266\277\371\024\340\276\301\312\355\276\236s$\277\210\210\005@$\360\016\277h\005\314?k\356\033>RY\237?\354^z\277z\004p\277\"\375T?:eh\277beW?\354\370\221\277\277\256\210\277X\246\354=\330\307\377\276\034\033\327?\375\254\001?I\300K\27773\306?\202\347>\277\321\241\203\277\0222m\276\347k\317\276\272\335X>\365\233\253>"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "t1vkM7"
    raw_data: "4\203\322\301\322F\362\302\341\0350\302\202\314n\300\236D\272B\001,\261@Up\335\302\374\247HBI\241\253A\342\245\232\302r\313\020BA\031\020\302L7\035\302\234\251<B\330\036OB\361\332\341\301\217\364\274B\333\265\221\301\2743\364\301\341\276\020\303>Q\324B\201\310\005\301\205\362\226B\364\032\243B\376!\206A\242+\005\302Hh\272\302GHX\302\331U\323\277X#\217\302\327\372<\302\0360CB\337\023\264\301\200rK\302\311T\375A\244\212vA\323\327\227\301\013\265\220B\023\265\004\302A\250\217\301qW>\302\002\270*\3015\266\334A:\211W\3022\352\346\300\\\275gB7\235\211A\230#\357\302}!\377@\027\031\013\301\334\316\300A\035\031\271A\261\233D\301Z\251h>\013a.\302\3253\rB\001=\336A\212\260\234\302%^\246Am\264\365Aut\024BvE\215B\230m\227BZ\255$\302"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "Vvgi3n"
    raw_data: "m4\301D.\367\013ES\235\007E\352\214\014E\310\203\016E\314$\245D?\343\344D{\'\263D\036\326\230D|\211 E\235\305\340D\220\004\246D\004\206\311D\3648\006E\253\341\253D\017,\260Dm\307\027EJ\'\261Dp\013\347D\211\036\rE\355A\314D\310\363\357D\343\277\255Dv\341\001Ey \262D\217\277\016E{\177IE\216\237\247D\0269\"E\252\275\337D\362b\tE\261\026\037Ezi\325D(\206\340D,M\273D\2036\342D\023F\306DV\254\004E\335e\"E\223s\303D\321p\013EWO\321DE\314\270D0\003\021E1v\251D\303\250\332D\266j\nE\177\3445E\325\222\310D^\206\324D9\251\330Dtb\355DCv\251D\260\021\230D\030\312\336D#\270\341D\214\245\335D\222\333\271D\3209\374DG\260\236D3\332\225D\201z\234DL/\261D2\312\013E"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "Md18Nj"
    raw_data: "V,\355?\334\035\350?\2114\n@7\372\341?\025\t\320?fnd?\342\010\311?\031\204\232?\315Y\264?l\352\023@\245[\324?\270\"f?\207\'\325?\264\n\341?\260\025\200?\265z\224?\004\302\003@\232\317\275?\364\317\243?>\317\336?\367\r\310?\243\316\312?Y\256\202?W\205\357?\215\234\321?\255\357\013@\016H\037@\304L\237?t\004\005@\241\310\333?\363\322\352?\362\242\023@\177J\222?=\025\003@=\261\334?\000\221\300?e\321\314?\244\343\314?M.\003@=j\344?h$\033@:\273\324?\301\006\344?\020f\000@\245\023\276?\247\374\303?B\307\002@`\317\002@_&\312?\233i\305?I\205\363?\004\252\345?*\242m?\303\305\223?t\264\375?5\207\317?\260\313\256?\230\006\342?\211\326\341?\231<\320?F\331w?+3\253?I\021\205?\004\303\345?"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "JWs5mi"
    raw_data: "c\213\031\277w\232\010\276\245\025\271?o4\225\277\343\022k\276\330\370B\300/Y\007\276\327\334\201>\273E\277\276\254,\315\277\010^\244>\334\006]?=\010\260\276\323$\224\277\263\312\221>a\336\201>\205P\226\277\027\2073\277\0314S\277\344*\303?\212\323\025\275\344Af?%\343\345=u\266^?~C\024\277\347\220\'\276\211\333\237\275AB\371\276BN#\277RG_\277%?\001\300\371\312\204>\372\354\321\277\376/t>x\366\002?\2050\034\277K\315c\277\206\372\372\274-\214\224?\237\007!?3\3548\277f\331l?\333\363G?\000\206|<\204\315\006?{\223\330<\021\345U\277\205\tF?\234\014\203;q\261\350\275\316D\231?\253\355\030\300\334L.\277h\225\215?]c\361>8!\006=\307\274.\277\014\030d\276O3\337\276\241\213\262\276*\205/\277\215H\351\275\262\"\244\277\346O\212\276"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "ak31IC"
    raw_data: "\rG\237\300\000\246\216\300\210\362V\301u\230 \300\037\261!@I\002G?\236|{\300\370\000@\300\236\254\237\300\037\010\t@\336\'\013\301\177\024\371\276$\273\002\300\225\3340?cp\037?[B!@\347 \263\276\3456V\300\226\331y@BM\260?\352\t\363\300\241o\206@\266\357\242\277\325;K\300\344\361\221\277t\325 \276\237CO@\3347*?VP:\276\341!\233\277\271\036\031@\245\311\025?\036\327\357?\177\375\210\300\257%\235\277\321H\200\300\036 9\300\375j\214@\377\3630?.\205O@\371\257\237\300\006]\334?E\225\013\275\256\025\340@\027\\\256@\263V\270@T\233\026A\376o\225@JX\207?\251\026\331\300a\310C@\277\326\320?M\253\203\300\344\270@@\365\276\211\300~A\311\300\026\312\365\2773\243\231\300\3422\256@\022\337_@\375\027 A!\221\223\300\364y)@)\026\323\300"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "sGmiiv"
    raw_data: "\206\364\030C\243\310*C\267\307\tCN\354\036C\267{FC\026\205FC\376\356!C\200-,Ck\031^C\035{FC\016\0012C\206\'<C\305x\343B\014vdC\326U\004C*-/Cr\334OCAR:C\002\216TC\237\032\375B\017\311QCA|\006C\204L\020C8\312kCO\261;C\371\350\336Bdh\026Cg~VC~\223=C5\364\021Cp\253-C-\345vC\024\0310Cg\247\002C\336I\036C\023\273\036C\263\263\004C\370\204#C\223\216%C\010\030<C\311\357)C*\2215C\263\"AC\263\205\032C\250\236\032CF\0369C\3640\035C\014\027<CT\273OCP\374(CcsKC\3616,Co0hC\340;kC\261\377GC\330!$C\372K;Czh9CT\372)C\242dMCK\312\022C\344U.C\315\217WC|\241\354B"
  }
  initializer {
    dims: 64
    data_type: 1
    name: "3qsoQh"
    raw_data: "\253z\215?x\021\245?bl\246?\226Y\300?\200\225\231?\317e\033@\\\212\217?\256\356\276?\222\232\242?\325\332\366?\314\230\243?R\252\267?y\276{?\253/\301?l\372\241?,\312\230?\317\225\305?\211H\273?\367Q\272?\023\375\242?\'\235\275?\275\305\240?\036\224n?\332\244\371?\001\276\234?\320\301U?)\302\237?U\036\331?\3450\254?G\306\251?|\023\331?(1\253?J\007\354?_\230\177?\333g\243?\350\312\230?I\235\227?W\016\235?5b\301?\377}\247?q\261\251?\336\202\262?\240b\312?6\303\212\277\261m\225?\242k\230?\034\250\241?T\251\243?JJ\240? \004\211?\223\302\312?\344 \355?\271\000\304?\306\220\272?\347\277\246?\305O\226?\226\036\271?D\307\236?\323\024\256?Q\265\276?\356\313\207?\352\235\202\277+>\322?\330\373}?"
  }
  initializer {
    data_type: 7
    name: "N5TkJw"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    data_type: 7
    name: "unIRPl"
    raw_data: "\377\377\377\377\377\377\377\377"
  }
  initializer {
    data_type: 1
    name: "sSHNTQ"
    raw_data: "\000\000\000@"
  }
  initializer {
    dims: 4
    data_type: 7
    name: "zDePf2"
    raw_data: "\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\034\000\000\000\000\000\000\000\034\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "lfyLuI"
    raw_data: "\377\377\377\377\377\377\377\377"
  }
  initializer {
    data_type: 7
    name: "fzSkqo"
    raw_data: "\001\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "JrwCfY"
    raw_data: "\001\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: 7
    name: "Reshape_0_param0"
    raw_data: "\001\000\000\000\000\000\000\000\377\377\377\377\377\377\377\377"
  }
  initializer {
    dims: 1
    data_type: 1
    name: "UH7KkG"
    raw_data: "\000\000\200\277"
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "4QMvsz"
    raw_data: "\337\013A=t\365\034=\241\342==8}\030=@i\013=\251\033\311<-V\026=F\233\002=9\014%=y\311:=m@ =\021\023\312<\263\340)=qe\033=X\020\335<\233\037\375<\264\035+=\355W!=\'\333\363<S\014\026=\354]\036=\310\037\024=CT\340<\330\"(=\332\2571=\335e;=\n\2113=Z4\013=/\031\'=\257<&=\346E =\374G;=]\227\342<\210\362E=\317p6=O\332\020=\354\220$=\334M\016=\331\263$=\226\3308=\3755R=q[&=\257\306==}\231*=\0132%=Z\363\025=c\3321=\270/\033=\017}!=\2454\031=\024-;=\367\244(=\335\206\316<\025\223\007=\240M@=\'G\034=,\325\004=\361\222;=\307\341 =F\005;=\314\020\345<\331\326\032=^3\342<\314v\033="
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "bEqCUf"
    raw_data: "\304\326\213>&C\264@4\013^@K0^\276\365Ay\300rL\220\2760\375\230@\336[\347\277(P>\276~\245\211@\206\245\030\3001\210k?\022\257!@\277\230\037\300\235F\246\277\340\245\232?\346I\242\3006:\330?=\004`?\363\252\303@mq\245\300~!I?a\264\030\300\327vo\300\277\034\300\277\327\320\031@\277d\250@\026\254\r@\002v`\277\375\345C@\025\224H@\020\2308\277\261\021\361>nl\213@\272\315\034\300gm\223\277Y\340)\277}\343<\300\216\237^?P\005,>4\352\220@\300\376\377\275\\\236\241>Ba\031@\330\231\304?<UF\300U\235\327\277\304\226\253@\312n\234\277\376Q\225?\375x\017\300@O\001\300r\306\331>\310\320\001\2776\213n@U\036W\277\2500\331\277\263[\244@R\001\310\277\326\220\033\300,|\242\277/\322D\300\217~\360\277\276\351\362?"
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "ji6fNk"
    raw_data: "\216\010\267=\337\030\312=\344\331\342=\350 \364=Ol\256=tw0>\212z\264=\245\320\350=\260\222\256=\360,\014>\3760\304=\031<\326=\302\327\274=\227\177\314=\320I\341=9\264\270=8F\333=\347\206\333=\035z\314=\312\320\347=\356u\321=\n\321\335=7\343\236=\270\017\002>(\016\267=\320\372\241=\247l\320=w2\355=\230\030\310=\177\330\340=\361\306\003>\351Q\256=zJ\016>Z\343\262=\335\316\317=L\n\302=\r\225\322=*\203\304=\ty\360=\263f\303=\326F\320=c\367\323=\237\001\351=4\233\262\275-F\300=\322=\263=\324L\316= \357\276=\326\360\261=t\244\250=nq\343=\216\216\020>\274\316\315=R\240\302=\376\247\274=\340\270\273=\274l\330=|\222\272=\004\243\325=\006\351\324=BU\263=\263G\236\275\260\035\345=\240\314\272="
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "uLXe0m"
    raw_data: "\030\251\036\276t\354\234>Z\307;@\344\325]\277=\264\343\276\277\213K\300\321>[>\032=\030?@\377S=\354\260\362\277\252\274\223?\366\rj?A1\037\276R\371\234\277\206m]>\220R\330<\023\205\221\277V\\\257\2761~\233\27746\257?\325}=?\177\213\343>\"\022X>\251\373\242?\376X\364\276m\330\032\276\313\265\320\276\tX\020\277=\301\036\277\0347=\277\223\363\024\300t\226V>\300@\363\277\352\305\034?\225\332\"?\266\320k\276:\251\027\277_C\347\276\246(\212?\214\251\243>$\004\\\276\376;??\362\361H?\006I ?\300)v<\016\231\364\276\271P\344\277\240)\255>\364\365\263\275L\330\343>\345\220[?N\253\'\300\266\344\210\276i\350Q?N4^?B\366\033?\032\224\365\276\346\311[>u|\200\277\022^6\277\254\350\307\277\361\313\360\276\"\016\312\277\300\275\251>"
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "c10ZD9"
    raw_data: "y?\261\275H\341\240/S\325\301=y\371\234=k\013m\257t\006\276= 9\302=\331\331\331=7\003\277=*\300\261=5~\275=\035\374\271=s\305\275=\204M\252=;\355\267=.\021\271=\030\'\310=\222\273\r1\355%\335=\035\026\247=\222\211\254\275\200\202\261=\232\270\320= \377\275=U\002\236\275\345\217\310=\t\032\323=\376\200\2640D4\227=N\033\336=)o\276\275w`\310=W\027\260=-t\233\275\225\307\227=\025%\243\275\t\307\276=\013|\335=\026\343\303=\262\t\317=pMN=XR\262=v\363\320=\'\257\317=\216\276\310=\337B\245=\3755\273=L\323\237-\366\032\2710\325(\243=\375\034\2342\354\273\264=\314r\316=\231*\330\275\004E\341=\030|\310=\345\037\273=t3\254=\203\001\327=\006y\325=[\240\253=\351\254\265=q\024\262=\263\354\330="
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "p4G2mz"
    raw_data: "\036\227\032>\234H\270\261~n?>d\323\031\276\246>\234\260.[\250=P3\216\275\016\354\027?\207\310\326\2765\310\201\275\351\0019\276d&\346\276\270\020\262=\320\000y<^\277E\277\246\305s\276t\322H>\243\211\335\261\244\300\350\275\352\375\000>;\030U\276\3705\331<:\332\260\2769\201:\277\306\275O>\264W\240>~\017\363>B\004[\262\225\020J>\214\302\363>|\277a<\005\227\032\276\361\201f>\214\243\027\276\024\360\266>\242\357\340=i\265\207>\264\371\323>}\201\261\276E\246->\n \325\2754\206\360<\332\372\322=r\250(>d\316\207>!\254\026=6g,?\213D\324\257\305R\033\263\256L\221\276\354\334\0104r\327\223\276x\203m=\024\020\243\276\350}\306\276`\301\302\274;{\017\276\337\033\211\276\264G\363\275R8\000\276\0052O\276\350\014o\275Z\223\017?\222\326\233>"
  }
  initializer {
    dims: 1
    dims: 10
    data_type: 1
    name: "eWKZRQ"
    raw_data: "\314\247:=h\213-=\250\364/=\275\014\024=\335\276+=\302\\!=\032\327J=\365\370&=\2761\026=\024\021\035="
  }
  initializer {
    dims: 1
    dims: 10
    data_type: 1
    name: "Add_0_param0"
    raw_data: "6\260\246\277\027\001\253\277\265\033\234\277\303\207\233\277\317\271\223\277<\r\230\277\005.\256\277gt\231\277r\253\215\277ZQ\226\277"
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "Iavrhk"
    raw_data: "\337\013A=t\365\034=\241\342==8}\030=@i\013=\251\033\311<-V\026=F\233\002=9\014%=y\311:=m@ =\021\023\312<\263\340)=qe\033=X\020\335<\233\037\375<\264\035+=\355W!=\'\333\363<S\014\026=\354]\036=\310\037\024=CT\340<\330\"(=\332\2571=\335e;=\n\2113=Z4\013=/\031\'=\257<&=\346E =\374G;=]\227\342<\210\362E=\317p6=O\332\020=\354\220$=\334M\016=\331\263$=\226\3308=\3755R=q[&=\257\306==}\231*=\0132%=Z\363\025=c\3321=\270/\033=\017}!=\2454\031=\024-;=\367\244(=\335\206\316<\025\223\007=\240M@=\'G\034=,\325\004=\361\222;=\307\341 =F\005;=\314\020\345<\331\326\032=^3\342<\314v\033="
  }
  initializer {
    dims: 1
    dims: 10
    data_type: 1
    name: "Mul_0_param0"
    raw_data: "\314\247:=h\213-=\250\364/=\275\014\024=\335\276+=\302\\!=\032\327J=\365\370&=\2761\026=\024\021\035="
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "WwRCHa"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "t2KNC5"
    raw_data: "\216\010\267=\337\030\312=\344\331\342=\350 \364=Ol\256=tw0>\212z\264=\245\320\350=\260\222\256=\360,\014>\3760\304=\031<\326=\302\327\274=\227\177\314=\320I\341=9\264\270=8F\333=\347\206\333=\035z\314=\312\320\347=\356u\321=\n\321\335=7\343\236=\270\017\002>(\016\267=\320\372\241=\247l\320=w2\355=\230\030\310=\177\330\340=\361\306\003>\351Q\256=zJ\016>Z\343\262=\335\316\317=L\n\302=\r\225\322=*\203\304=\ty\360=\263f\303=\326F\320=c\367\323=\237\001\351=4\233\262=-F\300=\322=\263=\324L\316= \357\276=\326\360\261=t\244\250=nq\343=\216\216\020>\274\316\315=R\240\302=\376\247\274=\340\270\273=\274l\330=|\222\272=\004\243\325=\006\351\324=BU\263=\263G\236=\260\035\345=\240\314\272="
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "nfubnx"
    raw_data: "\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200\277\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 1
    dims: 64
    data_type: 1
    name: "wQYlcE"
    raw_data: "y?\261=H\341\240/S\325\301=y\371\234=k\013m/t\006\276= 9\302=\331\331\331=7\003\277=*\300\261=5~\275=\035\374\271=s\305\275=\204M\252=;\355\267=.\021\271=\030\'\310=\222\273\r1\355%\335=\035\026\247=\222\211\254=\200\202\261=\232\270\320= \377\275=U\002\236=\345\217\310=\t\032\323=\376\200\2640D4\227=N\033\336=)o\276=w`\310=W\027\260=-t\233=\225\307\227=\025%\243=\t\307\276=\013|\335=\026\343\303=\262\t\317=pMN=XR\262=v\363\320=\'\257\317=\216\276\310=\337B\245=\3755\273=L\323\237-\366\032\2710\325(\243=\375\034\2342\354\273\264=\314r\316=\231*\330=\004E\341=\030|\310=\345\037\273=t3\254=\203\001\327=\006y\325=[\240\253=\351\254\265=q\024\262=\263\354\330="
  }
  initializer {
    dims: 1
    dims: 1
    data_type: 1
    name: "MultiThreshold_0_param0"
    raw_data: "\000\000\000?"
  }
  initializer {
    dims: 784
    dims: 64
    data_type: 1
    name: "MatMul_0_param0"
    raw_data: 